АлогистикТест2/src/Documents/алк_Производство/алк_Производство.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_Производство</name>
  <registerRecords>AccumulationRegister.алк_ОстаткиЗапасов</registerRecords>
  <registerRecords>AccumulationRegister.алк_ПроизводствоОборот</registerRecords>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Операция</name>
    <type>
      <types>CatalogRef.алк_ОперацииПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.алк_СтатусыОтчетаПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Материалы</name>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.алк_Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Отходы</name>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.алк_Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Продукция</name>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.алк_Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>CatalogRef.СертификатыНаПродукцию</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Целевая</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/Documents/алк_Производство/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура УчастокПриИзмененииНаСервере()
	Элементы.Смена.ПараметрыВыбора = РфпСервер.ПолучитьОтборПоТипуСмены(Объект.Участок, Объект.ДатаСмены);
КонецПроцедуры

&НаКлиенте
Процедура УчастокПриИзменении(Элемент)
	УчастокПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ РольДоступна("ПолныеПрава") Тогда
		ЭтаФорма.Доступность = Ложь;			
	КонецЕсли;
	
	УчастокПриИзмененииНаСервере();   
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ алк_ПроизводствоСервер.ДоступностьРолиАдминистраторСистемы() Тогда	
		
		ПараметрыВвода = Новый Структура;
		ПараметрыВвода.Вставить("ДатаСмены", Объект.ДатаСмены);
		ПараметрыВвода.Вставить("Смена", Объект.Смена);
		ПараметрыВвода.Вставить("Операция", Объект.Операция);
		ПараметрыВвода.Вставить("Участок", Объект.Участок); 
		ПараметрыВвода.Вставить("Заголовок", Строка(Объект.Ссылка));
		
		Если алк_ПроизводствоСервер.ПолучитьЦехУчастка(Объект.Участок) = алк_ПроизводствоСервер.ПолучитьЦехДГ() Тогда //ДГ 
			
			ОткрытьФорму("Обработка.алк_РМ_МастераДГ.Форма", ПараметрыВвода,, Объект.Ссылка.УникальныйИдентификатор());
			
		ИначеЕсли алк_ПроизводствоСервер.ПолучитьЦехУчастка(Объект.Участок) = ПолучитьЦехПоКоду("000000002") Тогда //ЦПШ 
			
			ОткрытьФорму("Обработка.алк_РМ_МастераЦПШ.Форма", ПараметрыВвода,, Объект.Ссылка.УникальныйИдентификатор()); 
			
		ИначеЕсли алк_ПроизводствоСервер.ПолучитьЦехУчастка(Объект.Участок) = ПолучитьЦехПоКоду("000000009") Тогда //ИД 
			
			ОткрытьФорму("Обработка.алк_РМ_МастераФанеры.Форма", ПараметрыВвода,, Объект.Ссылка.УникальныйИдентификатор());
			
		ИначеЕсли алк_ПроизводствоСервер.ПолучитьЦехУчастка(Объект.Участок) = ПолучитьЦехПоКоду("000000001") //ЦЛП
			ИЛИ алк_ПроизводствоСервер.ПолучитьЦехУчастка(Объект.Участок) = ПолучитьЦехПоКоду("000000006") Тогда  //МЛП 
			
			ОткрытьФорму("Обработка.алк_РМ_МастераЦЛП.Форма", ПараметрыВвода,, Объект.Ссылка.УникальныйИдентификатор()); 
			
		Иначе
			
		КонецЕсли;
		
		Отказ = Истина;    
		
	КонецЕсли;
	
КонецПроцедуры   

&НаСервереБезКонтекста
Функция ПолучитьЦехПоКоду(КодЦеха)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	алк_Цеха.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.алк_Цеха КАК алк_Цеха
	               |ГДЕ
	               |	алк_Цеха.Код = &Код";
	Запрос.УстановитьПараметр("Код",КодЦеха);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		Возврат Выборка.Ссылка;
	КонецЦикла;
	
	Возврат Справочники.алк_Цеха.ПустаяСсылка();
	
КонецФункции
